app/views/fp_backeds/show.html.erb


 <% @fp_backed.pledges.each do |pledge| %>
---
SELECT "pledges".* FROM "pledges" WHERE "pledges"."fp_backed_id" = ?  [["fp_backed_id", 2]]