app/views/lit_fan_authors/show.html.erb

<ul>
  <% @lit_fan_author.lit_fan_works.each do |lit_fan_work| %>
---
SELECT "lit_fan_works".* FROM "lit_fan_works" WHERE "lit_fan_works"."lit_fan_author_id" = ?  [["lit_fan_author_id", 1]]