app/views/comments/index.html.erb

SELECT "comments".* FROM "comments"
---

<% @funding_project.comments.each do |comment| %>