app/views/pledges/new.html.erb

SELECT "funding_projects".* FROM "funding_projects"
---
                <h3><%= f.label "Choose the project" %></h3>
                <%= f.collection_select :funding_project_id, FundingProject.all, :id, :title %>