app/views/lit_fan_works/_form.html.erb

SELECT "lit_fan_genres".* FROM "lit_fan_genres"
---
        <label>Choose a Genre ... </label><br><br>
    <%= f.collection_check_boxes :lit_fan_genre_ids, LitFanGenre.all, :id, :name %><br>

SELECT "lit_fan_authors".* FROM "lit_fan_authors"
---
    <datalist id="lit_fan_authors_autocomplete">
    <% LitFanAuthor.all.each do |lfa| %>