app/views/users/show.html.erb

    <ul>
    <% @user.funding_projects.each do |ufp| %>
---
SELECT "funding_projects".* FROM "funding_projects" WHERE "funding_projects"."user_id" = ?  [["user_id", 1]]

    <ul>
        <% @user.sf_favs.each do |fav| %>
---
SELECT "sf_favs".* FROM "sf_favs" WHERE "sf_favs"."user_id" = ?  [["user_id", 19]]