app/views/l_stories/new.html.erb

SELECT "o_genres".* FROM "o_genres"
---
  <%= f.label "Choose an OpenGenre ... " %>
  <%= f.collection_check_boxes :o_genre_ids, OGenre.all, :id, :name %><br>