app/helpers/lit_fan_authors_helper.rb

SELECT "lit_fan_authors".* FROM "lit_fan_authors"
---
    def lit_fan_author_select(lit_fan_author, lit_fan_work)
        if lit_fan_author
            lit_fan_author.name
        else
            select_tag "lit_fan_work[lit_fan_author_id]", options_from_collection_for_select(LitFanAuthor.all, :id, :name)