app/controllers/addresses_controller.rb

  def show
    @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]