app/controllers/application_controller.rb

    def current_user
        # return unless session[:user_id]
        # @current_user ||=
        User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]