app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
SELECT  "funding_projects".* FROM "funding_projects" WHERE "funding_projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @comments = Comment.all
    funding_project = FundingProject.find(params[:funding_project_id])