app/controllers/fp_backeds_controller.rb

INSERT INTO "fp_backeds" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-08-10 00:31:39.775598"], ["updated_at", "2018-08-10 00:31:39.775598"]]
---
    def create
        @fp_backed = FpBacked.new(fp_backed_params)
        @fp_backed.save

SELECT  "fp_backeds".* FROM "fp_backeds" WHERE "fp_backeds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @fp_backed = FpBacked.find(params[:id])