app/controllers/fp_creators_controller.rb

  def index
    if params[:user_id]
      @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @fp_creator = FpCreator.new(fp_creator_params)
    # raise params.inspect

    # @fp_creator.lit_fan_works.build
      # = LitFanWork.where(fp_creator_id: params[:fp_creator_id])

    @fp_creator.save
---
INSERT INTO "fp_creators" ("name", "location", "creator_about", "creator_site", "instagram_url", "twitter_url", "facebook_url", "blog_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    if params[:user_id]
      @user = User.find_by(id: params[:user_id])
      @fp_creator = @user.fp_creators.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "fp_creators".* FROM "fp_creators" WHERE "fp_creators"."user_id" = ? AND "fp_creators"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]