app/controllers/funding_projects_controller.rb

SELECT "funding_projects".* FROM "funding_projects"
---
  def index
    @funding_projects = FundingProject.all

INSERT INTO "funding_projects" ("title", "description", "funding_goal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My First Project"], ["description", "This is my first project."], ["funding_goal", 200], ["created_at", "2018-07-23 15:45:22.210146"], ["updated_at", "2018-07-23 15:45:22.210146"]]
---
  def create
    @funding_project = FundingProject.new(funding_project_params)
    if @funding_project.save

SELECT  "funding_projects".* FROM "funding_projects" WHERE "funding_projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def body
    fpd = FundingProject.find(params[:id])

SELECT  "funding_projects".* FROM "funding_projects" WHERE "funding_projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @funding_project = FundingProject.find(params[:id])

SELECT  "funding_projects".* FROM "funding_projects" WHERE "funding_projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def description
    fpd = FundingProject.find(params[:id])