app/controllers/funding_projects_controller.rb

  def show
    @user = User.find_by(id: params[:user_id])
    @funding_project = @user.funding_projects.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "funding_projects".* FROM "funding_projects" WHERE "funding_projects"."user_id" = ?  [["user_id", 2]]