app/controllers/l_stories_controller.rb

SELECT "l_stories".* FROM "l_stories"
---
  def index
    @l_stories = LStory.all

INSERT INTO "l_stories" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sfasdfasdf"], ["content", "asdfasdfzsdf"], ["created_at", "2018-07-27 18:25:22.614106"], ["updated_at", "2018-07-27 18:25:22.614106"]]
---
  def create
    @l_story = LStory.new(l_story_params)
    if @l_story.valid?
      chosen_o_genre = OGenre.find(params[:id])
      @o_genre = @l_story.chosen_o_genre
      @l_story.save

SELECT  "l_stories".* FROM "l_stories" WHERE "l_stories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
      @l_story = LStory.find(params[:id])