app/controllers/lit_fan_authors_controller.rb

SELECT "lit_fan_authors".* FROM "lit_fan_authors" WHERE (name LIKE '%testa2%')
---
  def index
    @lit_fan_authors = LitFanAuthor.search(params[:term])

SELECT  "lit_fan_authors".* FROM "lit_fan_authors" WHERE "lit_fan_authors"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @lit_fan_author = LitFanAuthor.find(params[:id])

INSERT INTO "lit_fan_authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "John Smith"], ["created_at", "2018-08-05 15:58:54.742241"], ["updated_at", "2018-08-05 15:58:54.742241"]]
---
  def create
    @lit_fan_author = LitFanAuthor.new(lit_fan_author_params)

    # @lit_fan_author.lit_fan_works.build
      # = LitFanWork.where(lit_fan_author_id: params[:lit_fan_author_id])

    if @lit_fan_author.save