app/controllers/lit_fan_works_controller.rb

  def index
    if params[:lit_fan_author_id]
      # NEED THIS TO CHECK BECAUSE NEED TO ... WHY DO WE NEED THIS IF #NEW HAS THIS?
      # THIS IS DONE BECAUSE in case index is rendered where aUTHOR AND lit_fan_work ARE both LISTED; PRESUMABLY NOT NECESSARY IF ONLY ONE MODEL INVOLVED?
      @lit_fan_author = LitFanAuthor.find_by(id: params[:lit_fan_author_id])
      if @lit_fan_author.nil?
        redirect_to lit_fan_author_path, alert: "Author not found"
      else
        @lit_fan_works = @lit_fan_author.lit_fan_works
      end
    else
      @lit_fan_works = LitFanWork.all
---
SELECT  "lit_fan_authors".* FROM "lit_fan_authors" WHERE "lit_fan_authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "lit_fan_works".* FROM "lit_fan_works" WHERE "lit_fan_works"."lit_fan_author_id" = ?  [["lit_fan_author_id", 1]]

  def new
    if params[:lit_fan_author_id] && !LitFanAuthor.exists?(id: params[:lit_fan_author_id])
---
SELECT "lit_fan_authors".* FROM "lit_fan_authors"

  def create
    @lit_fan_work = LitFanWork.new(lit_fan_work_params)
    # raise params.inspect
    if @lit_fan_work.save
---
INSERT INTO "lit_fan_works" ("title", "lit_fan_author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hhhh"], ["lit_fan_author_id", 5], ["created_at", "2018-08-06 16:29:28.158853"], ["updated_at", "2018-08-06 16:29:28.158853"]]

  def show
    if params[:lit_fan_author_id]
      @lit_fan_author = LitFanAuthor.find_by(id: params[:lit_fan_author_id])
      @lit_fan_work = @lit_fan_author.lit_fan_works.find_by(id: params[:id])
      # This is done in case the specific work requested is expected to have the associated author with it
      # if @lit_fan_work.nil?
      #   redirect_to lit_fan_author_lit_fan_works_path(@lit_fan_author), alert: "Work not found"
           # This is done in case the specific work requested is expected to have the associated author with it but it doesn't
      # end
    else
      # And this is for in case the association ISN'T part of the request ... so in case eg you wanted to make a new lit_fan_work without an auithor for some other purpose later in the app?
      @lit_fan_work = LitFanWork.find(params[:id])
---
SELECT  "lit_fan_authors".* FROM "lit_fan_authors" WHERE "lit_fan_authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lit_fan_works".* FROM "lit_fan_works" WHERE "lit_fan_works"."lit_fan_author_id" = ? AND "lit_fan_works"."id" = ? LIMIT ?  [["lit_fan_author_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "lit_fan_works".* FROM "lit_fan_works" WHERE "lit_fan_works"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]