app/controllers/pledges_controller.rb

  def new
    @pledge = Pledge.new
    new_user_pledge = User.where(:id == @pledge.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create
    # @user = current_user
    new_pledge_fp = FundingProject.where(:id == @pledge.funding_project_id)
    @pledge = new_pledge_fp
    @pledge = Pledge.new(pledge_params)
    @pledge.user_id = session[:user_id]

    # binding.pry


    # need to make a new pledge and
    # @pledge.user_id = current_user
    # new_pledge = @pledge = Pledge.new(pledge_params)
    if @pledge.valid?
      @pledge.save
---
SELECT  "funding_projects".* FROM "funding_projects" WHERE "funding_projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "pledges" ("amount", "user_id", "funding_project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 300], ["user_id", 1], ["funding_project_id", 1], ["created_at", "2018-07-17 21:24:12.172070"], ["updated_at", "2018-07-17 21:24:12.172070"]]

  def show
    @pledge = Pledge.find(params[:id])
---
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]