app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "a@a.com"], ["LIMIT", 1]]
---
    def create

        # raise params.inspect

        user = User.find_by(params[:email])