app/models/funding_project.rb

SELECT "pledges".* FROM "pledges" WHERE "pledges"."funding_project_id" = ?  [["funding_project_id", 1]]
---
    def total_pledges
        self.pledges.map do |p|