app/models/lit_fan_work.rb

    def lit_fan_author_name=(name)
        lit_fan_author = LitFanAuthor.find_or_create_by(name: name)
---
INSERT INTO "lit_fan_authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "jjijijiji"], ["created_at", "2018-08-05 01:48:02.565219"], ["updated_at", "2018-08-05 01:48:02.565219"]]
SELECT  "lit_fan_authors".* FROM "lit_fan_authors" WHERE "lit_fan_authors"."name" = ? LIMIT ?  [["name", "joe schmoe"], ["LIMIT", 1]]

  def lit_fan_genres_attributes=(lit_fan_genre_attributes)
    lit_fan_genre_attributes.values.each do |lfg_attribute|
      lfg = LitFanGenre.find_or_create_by(lfg_attribute)
---
INSERT INTO "lit_fan_genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test 2 genre"], ["created_at", "2018-08-06 04:19:21.776310"], ["updated_at", "2018-08-06 04:19:21.776310"]]