app/models/user.rb

    def self.create_with_omniauth(auth)
        user = find_or_create_by(uid: auth['uid'], provider:  auth['provider'])
        user.email = auth['info']['email']
        user.password = auth['uid']
        user.name = auth['info']['name']
        user.image = auth['info']['image']
        if User.exists?(user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "cadistasio@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "cadistasio@gmail.com"], ["LIMIT", 1]]