app/views/funding_projects/new.html.erb

<h3>Creator Information</h3>
    <h3><%= f.collection_radio_buttons(:fp_creator_ids, FpCreator.all, :id, :creator_name) %><br>
---
SELECT "fp_creators".* FROM "fp_creators"