app/views/funding_projects/show.html.erb

<h3>Total Pledges So Far:</h3>
<%= @funding_project.total_pledges.sum  %><br><br>
---
SELECT "pledges".* FROM "pledges" WHERE "pledges"."funding_project_id" = ?  [["funding_project_id", 1]]
SELECT SUM() FROM "pledges" WHERE "pledges"."funding_project_id" = ?  [["funding_project_id", 1]]